Dlubal.RFEM5.IMaterial
Interface for working with material

Dlubal.RFEM5.IMaterial.GetData
Gets material parameters.
Returns: Material parameters.

Dlubal.RFEM5.IMaterial.SetData(System.UInt32@)
Sets material parameters.
Material: Material parameters.

Dlubal.RFEM5.IMaterial.Delete
Deletes material.

Dlubal.RFEM5.IMaterial.GetDatabaseMaterial
Gets interface for working with database material.
Returns: Database material interface.

Dlubal.RFEM5.IMaterial.GetModel
Gets interface for working with material model.
Returns:
Interface for working with material model.
There are the following supported material model interfaces:
IMaterialIsotropicMasonry2DModel
IMaterialIsotropicModel
IMaterialIsotropicThermalElasticModel
IMaterialOrthotropicElasticModel
IMaterialOrthotropicPlasticModel